import {
	lib,
	game,
	ui,
	get,
	ai,
	_status
} from "../../noname.js";
import {
	basic
} from "../../utility.js";

export async function character() {
	const hearthstone = {
		connect: true,
		character: {
			hs_player: ['male', 'shu', 4, ["hs_start"],
				['des:神秘的家伙，能将异世界的东西召唤出来，进行不一样的对局。', 'unseen']
			],
			hs_comp: ['male', 'shu', 4, ["hs_start"],
				['des:神秘的家伙，能将异世界的东西召唤出来，进行不一样的对局。', 'unseen']
			],
			//这是乱斗的初始人物，工具人
			hero_garrosh: ["male", "hs_warrior", 30, [],
				["des:加尔鲁什·地狱咆哮是前任部落大酋长，他由萨尔指定在大灾变之后作为继任者，直到决战奥格瑞玛结束后为沃金所继任。作为部落的新任大酋长，加尔鲁什是一位高傲且凶狠的战士，用铁腕手段统治着部落。他对联盟的憎恨如同野火一般熊熊燃烧，为了摧毁联盟他可以不惜一切代价。在他的巨斧感召下，兽人们将夺回属于自己的荣耀。", "unseen"]
			],
			hero_jaina: ["female", "hs_mage", 30, [],
				["des:吉安娜是人类现存最强大的女巫，也曾是达拉然最受信任的女法师，受训成为时任肯瑞托领袖的大法师安东尼达斯的私人特使。第三次战争前夕，安东尼达斯将吉安娜派遣至洛丹伦王国北部。在挚友兼伴侣阿尔萨斯·米奈希尔王子的陪同下，两人前往调查蔓延的瘟疫是否源自魔法。之后吉安娜目睹了洛丹伦陷落，在神秘先知麦迪文的指引下带领所有幸存者跨洋逃向卡利姆多。", "unseen"]
			],
			hero_rexxar: ["male", "hs_hunter", 30, [],
				["des:雷克萨 ，部落的勇士，一位具有半兽人半食人魔血统的兽王，是莫克纳萨氏族现存不多的族人之一。他在燃烧军团覆灭之后大力协助部落，并曾从部落的故敌手中拯救过奥格瑞玛的城池。由于混血血统，他是一位特别高大威猛的战士，他的两柄战斧在他精湛的战挤驾驭下威名赫赫。通常，他总是会和他忠诚的战熊伙伴米莎一起共进同出。", "unseen"]
			],
			hero_anduin: ["male", "hs_priest", 30, [],
				["des:安度因·莱恩·乌瑞恩是暴风城国王。他的名字取自暴风城历史上两位最负盛名的人物：传奇般的安度因·洛萨与他的祖父莱恩·乌瑞恩。在其父亲瓦里安·乌瑞恩于破碎海滩战死之后，加冕成为暴风城国王。与其父亲果断的战士形象不同，安度因更善于思考与外交，同时也是圣光教会的信徒。", "unseen"]
			],
			hero_guldan: ["male", "hs_warlock", 30, [],
				["des:古尔丹曾是一位德拉诺大陆的兽人萨满，他是兽族的第一位术士，也是兽族部落实际上的建立者。古尔丹背弃了萨满之路与他的人民和导师，为了个人利益和力量而投向了恶魔领主基尔加丹，因而对兽族沦为恶魔的奴隶与部落入侵艾泽拉斯负全责。在燃烧军团领袖的教导之下，古尔丹建立了暗影议会并成为其实际操纵者。此外，他还创造了令人闻声色变的亡灵战士——死亡骑士。 古尔丹被认为是有史以来最强大的术士之一。", "unseen"]
			],
			hero_malfurion: ["male", "hs_druid", 30, [],
				["des:玛法里奥·怒风是艾泽拉斯最伟大的德鲁伊，并且是半神塞纳留斯的一名学生。通过与大自然以及在翡翠梦境中与塞纳留斯的交流，玛法里奥现在保护着大自然免受恶魔的摧残。", "unseen"]
			],
			hero_uther: ["male", "hs_paladin", 30, [],
				["des:“光明使者”乌瑟尔是白银之手骑士团的首位圣骑士，并率领教团在第二次战争中迎击部落。在第三次战争中，乌瑟尔在守护泰瑞纳斯国王的骨灰瓮时被自己的得意门生阿尔萨斯王子背叛并杀害。", "unseen"]
			],
			hero_thrall: ["male", "hs_shaman", 30, [],
				["des:萨尔，将曾经的野蛮掠夺者转化为能工巧匠，并坚守着族人的未来。“萨尔”是兽人古伊尔年轻时候的绰号，那时他住在自己的第一个家，为了让第二次战争的兽人囚犯再也无法威胁艾泽拉斯而建的监狱；而萨尔，正是奴隶之意。古伊尔逃出监狱后并没有漫无目的地游荡，而是踏上寻根之旅，最后从先祖的萨满信仰中寻得了智慧。萨尔的萨满信仰指引着他的行动，他重整了部落，成为大酋长并领导他的人民在贫瘠之地上定居，那里正是以他的父亲杜隆坦的名字而命名的杜隆塔尔。", "unseen"]
			],
			hero_valeera: ["female", "hs_rogue", 30, [],
				["des:尽管瓦莉拉拒绝在部落和联盟的战争中站队，这位血精灵仍然不止一次挽救过暴风城国王的性命。一位骄傲的血精灵，曾与瓦里安·乌瑞恩并肩作战。她不仅是暴风城的顾问和护卫，更是新提瑞斯法议会的执法者。虽然她坚守血精灵的传统与忠诚，却不隶属于任何政府或阵营，只忠诚于瓦里安及其子。瓦莉拉的独立性与对朋友和理想的忠诚，使她成为了一个值得尊敬的角色。", "unseen"]
			],
			//皮肤
			hero_medivh: ["male", "hs_mage", 30, [],
				["des:麦迪文是艾泽拉斯世界最强大的凡人法师之一，继承其母大部分守护者之力，其位于赤脊山脉以南的逆风小径的法师塔卡拉赞，藏有海量的魔法书，是足以碾压法师王国达拉然的魔法圣地。", "unseen"]
			],
			hero_alleria: ["female", "hs_hunter", 30, [],
				["des:游侠三姐妹的大姐。奥蕾莉亚·风行者在巨魔战争中期，她击退了数之不尽的巨魔，最终高等精灵和人类的联盟在与巨魔的战争中获胜。", "unseen"]
			],
			hero_liadrin: ["female", "hs_paladin", 30, [],
				["des:女伯爵莉亚德琳是银月城的血精灵圣骑士组织血骑士的女首领，曾是一位信仰圣光的高阶牧师，后对自己的信仰大失所望，并在接下来的数年中磨练自己的武艺。当穆鲁被带回银月城之后，莉亚德琳和罗曼斯利用他的圣光能量培养出身负圣光之力的战士，并成为了第一位血骑士并作为其领袖。她在组织中具有绝对的号召力与威信。将天灾军团驱逐后，她现在致力于将燃烧军团消灭殆尽。", "unseen"]
			],
			hero_tyrande: ["female", "hs_priest", 30, [],
				["des:泰兰德出生于一万年前，与玛法里奥·怒风和伊利丹·怒风一同长大，成为一名新手女祭司。而怒风兄弟则走上了另一条道路。但当燃烧军团降临艾泽拉斯，他们的命运又再次发生了交集。泰兰德和玛法里奥走到了一起，并肩抵抗入侵的恶魔；而伊利丹则走上了一条黑暗的不归路，他假意与燃烧军团合作，并臣服于力量的诱惑。在击败燃烧军团，并发生大分裂之后，泰兰德和玛法里奥帮助重建的精灵国度；而伊利丹则被囚禁在海加尔山之下。", "unseen"]
			],
			hero_magni: ["male", "hs_warrior", 30, [],
				["des:麦格尼·铜须国王是铁炉堡的统治者，是历史上最著名的矮人之一，作为一个统治者，他展现出了无比的勇气和慷慨无私的品质，总是将人民的需求置于自身所求之前。他曾执行了一个古老的仪式，试图与大地沟通以了解大地裂变事件的起源。但他还没找到答案，就被变成一具钻石雕像。但是这个仪式并没有杀死他，而是将他的灵魂与世界的内心连接到了一起。尽管麦格尼的肉身发生了的变化，但他高贵的品质却留了下来。", "unseen"]
			],
			hero_lunara: ["female", "hs_druid", 30, [],
				["des:露娜拉是半神塞纳留斯的长女。她的树妖妹妹们象征着自然的平和与宁静之美，而露娜拉也与她们相差不远。她是荒野的无情守护者，也是不朽的证明：利爪和荆棘之下的自然充满血色。", "unseen"]
			],
			hero_nemsy: ["female", "hs_warlock", 30, [],
				["des:啃着卡利姆多暗夜精灵特产的天堂桃，表面上娇小玲珑的侏儒奈姆希·灵沼并不是看上去那么人畜无害，她是一名术士。与恶魔签订契约，以生命为代价，用灵魂进行交换，邪能和暗影在指尖流动。当她对你微笑的时候，千万不要被表象所迷惑，很有可能你已经成为了她下一个牺牲的目标。她身着腐蚀者套装，警告着每一个对她心存歹念的家伙，招惹术士就如同在刀尖上起舞。", "unseen"]
			],
			hero_thunder: ["male", "hs_shaman", 30, [],
				["des:雷神在成年时他想要唤醒众神前往了魔古族的禁地雷霆山之心,在山中碰到了正在冥想的莱登。雷神质问这位曾经的主人,可莱登没有回答,然后雷神愤怒的夺走了莱登的守护者力量,成为了雷电之王。在获得风暴之力后雷神很快的开始了他的统一计划,征服了许许多多的种族。在与天神白虎神灵的战斗中获胜,还收获了许多仰慕者。", "unseen"]
			],
			hero_maiev: ["female", "hs_rogue", 30, [],
				["des:玛维对责任的坚持无人可以动摇。对她来说，与邪恶斗争的一切行为都是正义的，但这也让她四处树敌，包括了暗夜精灵的高层成员。尽管如此，她对世界和人民的尽责保护是无可挑剔的。现在她大多数时间都在保卫着守望者地窟，这座古老的监牢不仅保存着伊利丹的尸体，还关押着他那些令人生畏的恶魔猎手仆从。", "unseen"]
			],
			hero_khadgar: ["male", "hs_mage", 30, [],
				["des:传奇魔法师卡德加不仅在奥术魔法上造诣惊人，他还是抵抗燃烧军团的中坚力量。大法师卡德加曾是守护者麦迪文手下的年轻学徒，亲身经历了前两次战争。", "unseen"]
			],
			hero_vashj: ["female", "hs_shaman", 30, [],
				["des:瓦丝琪曾是艾萨拉手下的一名上层精灵。永恒之井大爆炸后，瓦丝琪被扭曲成了纳迦。随后她接受了伊利丹·怒风的召唤，在外域为伊利丹效力。瓦丝琪在毒蛇神殿被杀死后，来到了暗影界，并被分配到了玛卓克萨斯。最终瓦丝琪成为了锐眼密院的女男爵，在平息玛卓克萨斯的内乱中发挥了重要作用。", "unseen"]
			],
			//ZZADAN
			hero_zzgywse: ["male", "hs_paladin", 30, [],
				["des:君侯秉忠义，见者肯相从。", "unseen"]
			],
			hero_zzzglady: ["male", "hs_priest", 30, [],
				["des:丞相计无穷，智胜帷幄中。", "unseen"]
			],
			hero_zzlbjels: ["male", "hs_warrior", 30, [],
				["des:百战犹不厌，无双誓争功。", "unseen"]
			],
			hero_zzas: ["female", "hs_shaman", 30, [],
				["des:曾是艾伦戴尔王国的女王，优雅矜持，有王者之相。现在是阿塔霍兰的冰元素领主。", "unseen"]
			],
			hero_zzbx: ["female", "hs_warlock", 30, [],
				["des:皮肤纯白如雪，嘴唇赤红如血，黑瀑布一般乌黑亮丽的头发，戴一个漂亮的红丝绸发卡，漂亮的淡褐色眼睛，像星星般闪烁着迷人的光芒。", "unseen"]
			],
			hero_zzhh: ["female", "hs_mage", 30, [],
				["des:出生在贫困家庭的红魔族魔法师，因偶然原因，学会了爆裂魔法并爱上了爆裂魔法，决意为爆裂魔法付出一切，每天不来一发不舒服。", "unseen"]
			],
			hero_zzdcwll: ["female", "hs_rogue", 30, [],
				["des:颦笑含剑影，何况舞扇风。", "unseen"]
			],
			hero_zzdqyls: ["female", "hs_druid", 30, [],
				["des:谁可称国色？乔公儿女好。长女形容姝，兼具心思巧。", "unseen"]
			],
			hero_zzxqaln: ["female", "hs_hunter", 30, [],
				["des:小女更堪怜，顾盼多言笑。翩翩逐星辰，流月满江表。", "unseen"]
			],
			hero_zzcclfm: ["male", "hs_warlock", 30, [],
				["des:归心多少士，驱驰竞浮尘。勿教人负我，宁负天下人。", "unseen"]
			],
			//染柒
			hero_addiction: ["male", "hs_corruptor", 30, [],
				["des:一个炉石痴迷玩家，但不精通，玩过多种桌游，是无名杀的忠实粉丝，也是炉石普通的粉丝。", "unseen"]
			],
		},
		translate: { //工具人
			hs_player: "召唤师",
			hs_comp: "召唤师",
			//炉石传说
			hero_garrosh: "加尔鲁什",
			hero_jaina: "吉安娜",
			hero_rexxar: "雷克萨",
			hero_anduin: "安度因",
			hero_guldan: "古尔丹",
			hero_malfurion: "玛法里奥",
			hero_uther: "乌瑟尔",
			hero_thrall: "萨尔",
			hero_valeera: "瓦莉拉",
			//皮肤
			hero_medivh: "麦迪文",
			hero_alleria: "奥蕾莉亚",
			hero_liadrin: "莉亚德琳",
			hero_tyrande: "泰兰德",
			hero_lunara: "露娜拉",
			hero_magni: "麦格尼",
			hero_nemsy: "奈姆希",
			hero_thunder: "雷电之王",
			hero_maiev: "玛维",
			hero_khadgar: "卡德加",
			hero_vashj: "瓦丝琪女士",
			//染柒
			hero_addiction: "染柒",
			//ZZADAN
			hero_zzbx: "白雪",
			hero_zzhh: "惠惠",
			hero_zzas: "艾莎",
			hero_zzdcwll: "貂蝉瓦莉拉",
			hero_zzlbjels: "吕布加尔鲁什",
			hero_zzgywse: "关羽乌瑟尔",
			hero_zzzglady: "诸葛亮安度因",
			hero_zzdqyls: "大乔伊莉斯",
			hero_zzxqaln: "小乔阿兰娜",
			hero_zzcclfm: "曹操拉法姆",
		},
		dynamicTranslate: {},
		characterReplace: {},
	};
	if (lib.device || lib.node) {
		for (var i in hearthstone.character) {
			hearthstone.character[i][4].push(`ext:${basic.extensionName}/resource/asset/duelist/${i}.jpg`);
			hearthstone.character[i][4].push("noDefaultPicture");
		}
	} else {
		for (var i in hearthstone.character) {
			hearthstone.character[i][4].push(`db:extension-${basic.extensionName}/resource/asset/duelist:${i}.jpg`);
			hearthstone.character[i][4].push("noDefaultPicture");
		}
	}
	return hearthstone;
};