import {
	lib,
	game,
	ui,
	get,
	ai,
	_status
} from "../noname.js";
import {
	basic
} from "../utility.js";
import cons from "./cons.js";

export const constant = {
	testing: [ //测试卡效
		/*这是一个残局示范
		{
			startmana: 10,
			heroskill_usable: 10,
			zerocost: true,
			nogamedraw: true,
			me: "hero_jaina",
			medeck: ["烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽"],
			mehand: ["烈焰巨兽", "烈焰巨兽"],
			mefellow: ["烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽"],
			mesecret: ["以眼还眼"],
			meweapon: "奥金斧",
			enemy: "hero_rexxar",
			enemydeck: ["烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽"],
			enemyhand: ["烈焰巨兽", "烈焰巨兽"],
			enemyfellow: ["烈焰巨兽", "烈焰巨兽", "烈焰巨兽", "烈焰巨兽"],
			enemysecret: ["寒冰屏障"],
			enemyweapon: "灰烬使者",
			othercode() {
				game.me.hs_dm = 29;
			},
		}*/
		{
			dialog: "扳机自触发保护测试",
			intro: "提示：发动法力过剩",
			startmana: 0,
			me: "hero_guldan",
			medeck: ["烈焰巨兽*12", "法力过剩", "小精灵*2"],
			mefellow: [
				["苦痛侍僧", 7]
			],
			enemy: "hero_rexxar",
			enemyfellow: [],
			enemydeck: ["烈焰巨兽*12", "小精灵*3"],
			othercode() {
				game.me.addvaluebuff([0, 1020]);
				game.enemy.addvaluebuff([0, 1020]);
			},
		}
	],
	//RD常量
	extpath: basic.extensionDirectoryPath,
	clickatk() {
		if (!_status.hsbattling) this.HSF("morefocus");
		var tht = this;
		if (game.me.HSF("phaseUse")) {
			var atker = _status.hs_pressatker;
			if (!atker) { //如果没选攻击者
				if (tht.getLeader() == game.me) {
					if (tht.HSF("canatk")) {
						_status.hsbattling = true;
						_status.hs_pressatker = tht;
						tht.classList.add("hs_atkprepare");
						if (tht.isMin()) get.HSF("Aud", [tht, "attack"]);
						else tht.HSFT("攻击");
					} else {
						if (tht == game.me && !tht.data_weapon) game.me.HSFT("需要武器");
						else if (tht.hs_atk_max + tht.hs_ex_atk <= tht.hs_attacked) {
							if (tht.isMin()) game.me.HSFT("随从已攻击");
							else game.me.HSFT("英雄已攻击");
						} else if (tht.summoned && !tht.hasgjz("chongfeng")) game.me.HSFT("随从需准备");
						else game.me.HSFT("普通错误");
					}
				}
			} else { //否则选攻击目标
				var cancel = function() {
					_status.hsbattling = false;
					_status.hs_pressatker.classList.remove("hs_atkprepare");
					delete _status.hs_pressatker;
				};
				if (atker.sctp("opposide", tht)) { //如果选了对方的目标
					if (atker.HSF("canbetarget", [null, tht, "attack"])) { //如果攻击成立
						_status.hs_pressdef = tht;
						tht.addTempClass("target");
						lib.skill.hs_presstoatk = {
							direct: true,
							content() {
								"step 0"
								event.attacker = _status.hs_pressatker;
								event.victim = _status.hs_pressdef;
								event.attacker.hs_attack(event.victim).quick = true;
								"step 1"
								delete _status.hs_pressatker;
								delete _status.hs_pressdef;
								_status.hsbattling = false;
							},
						};
						ui.click.skill("hs_presstoatk");
					} else { //不是合理目标
						cancel();
						if (tht.hasgjz("qianxing")) game.me.HSFT("攻击潜行随从");
						else if (!tht.HSF("hasCFeff") && tht.sctp("myside_", t => t.HSF("hasCFeff"))) game.me.HSFT("场面有嘲讽");
						else game.me.HSFT("普通错误");
					}
				} else cancel();
			}
		}
	},
	brawlscene: [{
		name: "转角撞见鬼",
		type: "specialdeck",
		intro: "使用随机套牌进行游戏。套牌中的所有牌全部随机，你永远猜不到下一张牌会给你带来惊喜还是惊吓！每次进入乱斗，你都会重新获得一副和之前不同的随机套牌。",
		deck: {
			randomjobcard: 15,
			randomneutral: 15,
		},
	}, {
		name: "勇闯盘丝洞",
		type: "specialdeck",
		intro: "使用随机套牌进行游戏。玩家的套牌由23张结网蛛和7张所选英雄的随机法术构成。每次乱斗中，你得到的法术都不尽相同。同一法术可能有多张。",
		deck: {
			randomSpell: 7,
			certain: ["结网蛛", 23],
		},
	}, {
		name: "遍地传送门",
		type: "specialdeck",
		intro: "使用随机套牌进行游戏。玩家的套牌由23张不稳定的传送门和7张所选职业的随机法术构成。每次乱斗中，你得到的法术都不尽相同。在某次乱斗的套牌中，同一法术可能有多张。",
		deck: {
			randomSpell: 7,
			certain: ["不稳定的传送门", 23],
		},
	}, {
		name: "发现之旅",
		type: "specialdeck",
		intro: "使用固定套牌进行游戏。玩家的套牌由30张乌鸦神像构成。玩家可以通过发现机制来自主的选择获得随从或者法术。不过，武器牌就基本和玩家无缘了。",
		deck: {
			certain: ["乌鸦神像", 30],
		},
	}, {
		name: "黑心船长的财宝",
		type: "specialrule",
		intro: "使用固定套牌进行游戏。玩家的套牌由30张海盗构成，但每个回合开始时，你的抽牌动作被替换成了从三张卡牌中随机挑选一张加入你的手牌。",
		deck: {
			certain: ["hs_Pirate_monster", 30],
		},
		rules: {
			phaseDraw(player) {
				player.hs_discover();
			},
		},
	}],
	challengescene: [{
		name: "挑战帕奇维克",
		prepare: {
			cardback: "NAXX",
			equip: "铁钩",
			first: true,
			deck: [],
			nophasedraw: true,
		},
	}, {
		name: "挑战大宝",
		diy: true,
		prepare: {
			cardback: "炎魔之王",
			equip: "圣光的正义",
			first: true,
			deck: new Array(30).fill('乌鸦神像'),
		},
	}],
	bossinfo: { //首领
		帕奇维克: {
			base: ["leader_pqwk", "male", 45, "chdj"],
			chdj: ["仇恨打击", "消灭一个随从", "hs_leader", 4, "target.HSF('cuihui')", ["F:mns", "return get.dmgEffect(target, player, player,2)+ (target.HSF('hasCFeff')?100:0)+ target.hp*3;"], {
				order() {
					var p = get.player();
					if (p.sctp("notmine").filter(i => i.HSF("hasCFeff")).length > 1) return 6;
					else return 0.05;
				},
				result: {
					player: 1
				},
			}],
		},
		大宝: {
			base: ["leader_dabao", "male", 40, "hs_pj"],
			hs_pj: ["破军", "施放一张升级。", "hs_leader", 0, "event.insert(lib.card.hs_Upgrade.content,{player:player});"],
		},
	},
	funcs: {
		//battleRoal
		空手(p, c) {
			return p.countCards("h", ca => ca != c) == 0;
		},
		机械(p) {
			return p.sctp("mine", fl => fl.rkind == "machine");
		},
		龙牌(p, c) {
			return p.countCards("h", ca => ca != c && get.rkind(ca) == "dragon") > 0;
		},
		宇宙(p, c) {
			var cs = p.cardPile.getCards("h").map(i => i.name);
			return Array.from(new Set(cs)).length == cs.length;
		},
		手多(p, c) {
			return p.countCards("h") > p.getOppo().countCards("h");
		},
		//recheck
		对方回合(evt, p, f) {
			return _status.currentPhase != p;
		},
		满场(evt, p, f) {
			return p.countFellow() < 7;
		},
		存活(evt, p, f) {
			return f.HSF("alive");
		},
		法术(evt, p) {
			return get.type(evt.card) == "HS_spell";
		},
		法术目标(evt, p, f) {
			return get.type(evt.card) == "HS_spell" && evt.target == f;
		},
	},
	//职业图标
	ns: ["hs_mage", "hs_warrior", "hs_priest", "hs_hunter", "hs_warlock", "hs_druid", "hs_paladin", "hs_rogue", "hs_shaman", "hs_corruptor", "hs_neutral"],
	//加粗关键字
	jiacu: ["沉默", "冻结", "潜行", "免疫", "战吼", "亡语", "激怒", "冲锋", "风怒", "圣盾", "嘲讽", "剧毒", "吸血", "激励", "传说", "零件", "抽到时施放", "每回合限一次", "冲冲冲冲锋", "连击", "发现", "抉择"],
	//异能关键字
	yineng: {
		...cons.yineng
	},
	//隐藏关键字
	yincang: {
		...cons.yincang
	},
	//扳机(如果不加上，该时机效果无法触发)(前5个为关键时机)
	triggers: ["battleRoal", "deathRattle", "jili", "beginning", "ending", "useCard", "useCardTo", "useCardAfter", "hsdmgBefore", "hsdmgBegin1", "hsdmgBegin2", "hsdmg", "hsrcv", "summonBefore", "summonSucc", "summonAfter", "deathFL", "equipBefore", "equipAfter", "attackBefore", "attackBegin", "attackEnd", "overload", "discard", "discarded", "heroskillAfter", "drawAfter", "secretBegin", "changeHujia"],
	//扳机关键字英文
	ywm: {
		战吼: "battleRoal",
		亡语: "deathRattle",
		激励: "jili",
		开始: "beginning",
		结束: "ending",
	},
	//复杂描述解析
	fzms: {
		"每开": ["在每个回合开始时", "beginning"],
		"每束": ["在每个回合结束时", "ending"],
		"开始": ["在你的回合开始时", "beginning", {
			self: true,
		}],
		"结束": ["在你的回合结束时", "ending", {
			self: true,
		}],
		"法前": ["每当你施放一个法术便", "useCard", {
			self: true,
			filter: "法术",
		}],
		"法后": ["在你施放一个法术后", "useCardAfter", {
			self: true,
			filter: "法术",
		}],
		"邪使": ["每当你以该随从为目标施放一个法术时便", "useCard", {
			filter: "法术目标",
			self: true
		}],
		"用时": ["每当你使用一张牌时便", "useCard", {
			self: true,
			notlink: true
		}],
		"受伤": ["每当该随从受到伤害", "hsdmg", {
			fl: true
		}],
		"大疗": ["每当一个角色获得治疗便", "hsrcv"],
		"小疗": ["每当一个随从获得治疗便", "hsrcv", {
			filter(evt) {
				return evt.player.isMin();
			},
		}],
	},
	fullname: {
		jaina: "吉安娜·普罗德摩尔",
		garrosh: "加尔鲁什·地狱咆哮",
		anduin: "安度因·乌瑞恩",
		malfurion: "玛法里奥·怒风",
		uther: "乌瑟尔·光明使者",
		valeera: "瓦莉拉·萨古纳尔",
		tyrande: "泰兰德·语风",
		liadrin: "女伯爵莉亚德琳",
		magni: "麦格尼·铜须",
		alleria: "奥蕾莉亚·风行者",
		nemsy: "奈姆希·灵沼",
		zzdcwll: "貂蝉瓦莉拉",
		zzlbjels: "吕布加尔鲁什",
		zzgywse: "关羽乌瑟尔",
		zzzglady: "诸葛亮安度因",
		zzdqyls: "大乔伊莉斯",
		zzxqaln: "小乔阿兰娜",
		zzcclfm: "曹操拉法姆",
	},
	//仅用于标记
	bjcls: ["hs_legend", "hs_DIYfl", "guanghuan", "banji", "wangyu", "jili"],
	//沉默去除的关键字
	canchenmo: [...cons.canchenmo],
	//沉默去除的状态
	canchenmozt: ["noattack"],
	//基础英雄
	duelist: ["hero_jaina", "hero_garrosh", "hero_rexxar", "hero_anduin", "hero_guldan", "hero_malfurion", "hero_uther", "hero_thrall", "hero_valeera", "hero_addiction"],
	//英雄皮肤
	skin: [
		//第一套皮肤
		"hero_medivh", "hero_alleria", "hero_liadrin", "hero_tyrande", "hero_magni", "hero_lunara", "hero_nemsy", "hero_thunder", "hero_maiev",
		//第二套皮肤
		"hero_khadgar", "hero_vashj",
		//zzDIY
		"hero_zzbx", "hero_zzhh", "hero_zzcclfm", "hero_zzas", "hero_zzdcwll", "hero_zzlbjels", "hero_zzgywse", "hero_zzzglady", "hero_zzdqyls", "hero_zzxqaln"
	],
	//diy职业
	diy: ["hs_corruptor"],
	//翻译
	//稀有度
	rarity: {
		essential: "基础",
		ordinary: "普通",
		rare: "稀有",
		epic: "史诗",
		legend: "传说",
	},
	//职业
	easy: {
		"hs_mage": "法师",
		"hs_warrior": "战士",
		"hs_priest": "牧师",
		"hs_hunter": "猎人",
		"hs_warlock": "术士",
		"hs_druid": "德鲁伊",
		"hs_paladin": "圣骑士",
		"hs_rogue": "潜行者",
		"hs_shaman": "萨满祭司",
		"hs_corruptor": "腐化者",
		"hs_neutral": "中立",
		"hs_dream": "梦境",
		"hs_leader": "首领",
	},
	//种族
	rkind: {
		dragon: "龙",
		totem: "图腾",
		demon: "恶魔",
		wildbeast: "野兽",
		murloc: "鱼人",
		machine: "机械",
		none: "无",
		pirate: "海盗",
		goblin: "哥布林",
		undead: "亡灵",
		elemental: "元素",
		naga: "纳迦",
	},
	//随从缩写翻译
	cdan: {
		大螺丝: "炎魔之王拉格纳罗斯",
		吼爹: "格罗玛什·地狱咆哮",
		血法: "血法师萨尔诺斯",
		马云: "麻风侏儒",
		叫嚣: "叫嚣的中士",
		蛋总: "伊利丹·怒风",
		安东尼: "大法师安东尼达斯",
		詹姆斯: "银背族长",
		哀绿: "巫师学徒",
		火车王: "火车王里诺艾",
		红龙: "阿莱克丝塔萨",
		蓝龙: "玛里苟斯",
		芬克: "芬克·恩霍尔",
		风投: "风险投资公司雇佣兵",
		奥金尼: "奥金尼灵魂祭司",
		环: "治疗之环",
		盾: "真言术：盾",
		痛: "暗言术：痛",
		灭: "暗言术：灭",
		电线杆: "上古看守者",
		二五仔: "疯狂投弹者",
		无面: "无面操纵者",
		AC: "精灵弓箭手",
		飞刀: "飞刀杂耍者",
		爆牌鱼: "寒光智者",
		战利品: "战利品贮藏者",
		城管: "奥尔多卫士",
		生平: "生而平等",
		烧烤: "狂野炎术师",
		老牛: "凯恩·血蹄",
		钓鱼王: "纳特·帕格",
		老佛爷: "提里奥·弗丁",
		奥垃圾: "风领主奥拉基尔",
		电视: "召唤传送门",
		力代: "力量的代价",
		纯净水: "耐普图隆",
		马桶: "法力之潮图腾",
		小软: "酸性沼泽软泥怪",
		微软: "血帆海盗",
		工匠大师: "工匠大师欧沃斯巴克",
		囚徒: "哈里森·琼斯",
		冰环: "冰霜新星",
		女王: "希尔瓦娜斯·风行者",
		tc130: "精神控制技师",
		白富美: "秘教暗影祭司",
		易建联: "年迈的法师",
		涂毒: "致命药膏",
		爆刀: "剑刃乱舞",
		大范: "艾德温·范克里夫",
		大宝剑: "真银圣剑",
		机关枪: "复仇之怒",
		大表哥: "死亡之翼",
		nova: "神圣新星",
		偷: "思维窃取",
		控: "精神控制",
		pdd: "石拳食人魔",
		蓝胖: "虚空行者",
		军七: "军情七处特工",
		大王: "加拉克苏斯大王",
	},
	exhrsk: {
		//图哈特
		diej: ["坚壁", "获得4点护甲", "hs_warrior", 2, "player.changeHujia(4);"],
		huoc: ["二级火焰冲击", "造成2点伤害", "hs_mage", 2, "target.hs_dmgrcv('damage',2,player,'fire').hs_heroskill=true;", ["F:all", "return get.dmgEffect(target, player, player,2) + 0.1;"], {
			order: 6,
			result: {
				player(player) {
					if (game.hasPlayer(function(target) {
							return get.dmgEffect(target, player, player, 2) + 0.1 > 0;
						})) return 1;
					else return 0;
				},
			},
		}],
		shej: ["弩炮射击", "对敌方英雄造成3点伤害", "hs_hunter", 2, "target.hs_dmgrcv('damage',3, player).hs_heroskill=true;", "R:function(player){return player.getOppo();}"],
		zhil: ["治疗术", "恢复4点生命值", "hs_priest", 2, "target.hs_dmgrcv('recover',4,player).hs_heroskill=true;", ["F:all", "return get.rcvEffect(target, player, player,1) + 0.1;"], {
			order: 1,
			result: {
				player(player) {
					var val = Math.max.apply(Math, player.sctp().map(i => get.rcvEffect(i, player, player) + 1));
					return val;
				},
			},
		}],
		fenl: ["灵魂分流", "抽一张牌", "hs_warlock", 2, "player.hs_drawDeck();", "", {
			order: 6,
			result: {
				player(player) {
					if (player.cardPile.countCards("h")) return 1;
					else return 0;
				},
			},
		}],
		biax: ["恐怖变形", "本回合+2攻击力。+2护甲值。", "hs_druid", 2, "player.hs_atkhj([2,2]);"],
		yuaj: ["白银之手", "召唤两个1/1的白银之手新兵。", "hs_paladin", 2, "player.SSfellow(['白银之手新兵',2]);"],
		ttzh: ["图腾崇拜", "召唤一个你想要的图腾。", "hs_shaman", 2, [
			`
			const list = get.HSA("collect").图腾.map(i=>get.chscard(i));
			const dialog = ui.create.dialog("图腾崇拜：召唤一个你想要的图腾", 'hidden');
			dialog.classList.add("faxian4");
			dialog.addAuto(list);
			player.chooseButton(dialog, true).set("ai",b=>Math.random());
			`,
			"player.SSfellow(result.links[0].name);"
		]],
		shad: ["浸毒匕首", "装备一把2/2的匕首。", "hs_rogue", 2, "player.hs_weapon('浸毒匕首').hs_heroskill=true;", "", {
			order: 6,
			result: {
				player(player) {
					if (player.data_weapon) return 0;
					else return 1;
				},
			},
		}],
		//其他
		ltngjlt: ["雷霆震击", "造成2点伤害。", "hs_shaman", 2, "target.hs_dmgrcv('damage',2,player,'thunder').hs_heroskill=true;", ["F:all", "return get.dmgEffect(target, player, player,2) + 0.1;"], {
			order: 6,
			result: {
				player(player) {
					if (game.hasPlayer(function(target) {
							return get.dmgEffect(target, player, player, 2) + 0.1 > 0;
						})) return 1;
					else return 0;
				},
			},
		}],
		xljcam: ["心灵尖刺", "造成2点伤害。", "hs_priest", 2, "target.hs_dmgrcv('damage',2,player).hs_heroskill=true;", ["F:all", "return get.dmgEffect(target, player, player,2) + 0.1;"], {
			order: 6,
			result: {
				player(player) {
					if (game.hasPlayer(function(target) {
							return get.dmgEffect(target, player, player, 2) + 0.1 > 0;
						})) return 1;
					else return 0;
				},
			},
		}],
		xlslam: ["心灵碎裂", "造成3点伤害。", "hs_priest", 2, "target.hs_dmgrcv('damage',3,player).hs_heroskill=true;", ["F:all", "return get.dmgEffect(target, player, player,3) + 0.1;"], {
			order: 6,
			result: {
				player(player) {
					if (game.hasPlayer(function(target) {
							return get.dmgEffect(target, player, player, 3) + 0.1 > 0;
						})) return 1;
					else return 0;
				},
			},
		}],
		peiy: ["培育！", "抽一张牌并获得一个法力值", "hs_neutral", 2, "player.HSF('gainmana', [1]);player.draw();"],
		smhx: ["生命虹吸！", "吸血，造成3点伤害。", "hs_neutral", 2, "target.hs_dmgrcv('damage',3,player,'thunder').hs_heroskill=true;player.hs_dmgrcv('recover', 3,player).hs_heroskill=true;", ["F:all", "return get.dmgEffect(target, player, player,3) + 0.1;"], {
			order: 6,
			result: {
				player(player) {
					if (game.hasPlayer(function(target) {
							return get.dmgEffect(target, player, player, 3) + 0.1 > 0;
						})) return 1;
					else return 0;
				},
			},
		}],
		dyh: ["地狱火！", "召唤一个6/6的地狱火。", "hs_warlock", 2, "player.SSfellow('地狱火');"],
		sbcz: ["死吧，虫子！", "随机对一个敌人造成8点伤害。", "hs_neutral", 2, "target.hs_dmgrcv('damage',8, player).hs_heroskill=true;", "R:function(player){return player.HSF('randmgfil', ['opposide']);}"],
	},
	anms: { //入场动画
		飞入: ["雏龙"],
		报告: ["白银之手新兵"],
		火车王: ["火车王里诺艾"],
	},
	anmstm: { //入场动画延时多久播放音效
		报告: 1200,
		火车王: 500,
	},
	specialAudio: { //卡牌语音彩蛋
		"伊利丹·怒风": ["玛法里奥"],
		"凯恩·血蹄": ["加尔鲁什"],
		"瓦里安·乌瑞恩": ["安度因"],
		"威尔弗雷德·菲兹班": ["加拉克苏斯大王"],
	},
	collect: { //卡牌小类
		动物伙伴: ["雷欧克", "霍弗", "米莎"],
		图腾: ["治疗图腾", "石爪图腾", "灼热图腾", "空气之怒图腾"],
		零件: ["重型护甲", "时间回溯装置", "生锈的号角", "隐秘力场", "紧急冻结剂", "形体改造仪", "旋风之刃"],
		梦境: ["梦境", "梦魇", "翡翠幼龙", "欢笑的姐妹", "伊瑟拉苏醒"],
		和弦: ["我是鱼人", "潜行者的伎俩", "部落的力量"],
		部落勇士: ["霜狼步兵", "牛头人战士", "萨尔玛先知", "银月城卫兵", "森金持盾卫士", "凯恩·血蹄"],
		惊人的发明: ["修理机器人", "壮胆机器人3000型", "导航小鸡", "变鸡器"],
	},
	audioDura: { //台词时长
		吉安娜: {
			开局: 1,
		},
		泰兰德: {
			开局: 1,
			玛法里奥: 2,
		},
		莉亚德琳: {
			开局: 3,
		},
		露娜拉: {
			开局: 1,
		},
		古尔丹: {
			开局: 3,
		},
		加尔鲁什: {
			开局: 3,
		},
		雷克萨: {
			开局: 1,
		},
		萨尔: {
			开局: 1,
		},
		雷电之王: {
			开局: 4,
		},
	},
	台词: {
		common: {
			牌库快空: "我的卡牌就快要用光了！",
			牌库空: "我已经没有卡牌了！",
		},
		加尔鲁什: {
			开局: "不胜利，毋宁死",
			镜像开局: "哈哈哈，有种来啊",
			攻击: "Lok'tar ogar",
			投降: "我选择死亡。",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		吉安娜: {
			开局: "这可是你自找的",
			镜像开局: "那就来吧",
			攻击: "我准备好了",
			投降: "你...赢了。",
			//彩蛋
			阿尔萨斯: "情况还不算严重，对吧，阿尔萨斯？",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		雷克萨: {
			开局: "狩猎开始了",
			镜像开局: "看谁笑到最后",
			攻击: "我亲自出马",
			投降: "打得好，我认输。",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		安度因: {
			开局: "圣光将赐予我胜利",
			镜像开局: "圣光也向我露出了微笑",
			攻击: "以圣光之名",
			投降: "你击败了我",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		古尔丹: {
			开局: "我会夺取你的灵魂",
			镜像开局: "我将成为你的梦魇",
			攻击: "吃点苦头吧",
			投降: "这次是你赢了",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		玛法里奥: {
			开局: "我是大自然的守护者",
			镜像开局: "谨遵大自然的教诲！",
			攻击: "为了大自然",
			投降: "我承认，你赢了",
			//彩蛋
			泰兰德: "泰兰德，我的挚爱",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		乌瑟尔: {
			开局: "荣耀赐予我力量！",
			镜像开局: "圣光就是我的利刃",
			攻击: "为了正义！",
			投降: "胜利属于你",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		萨尔: {
			开局: "为了毁灭之锤！",
			镜像开局: "为了部落！",
			攻击: "元素之灵，指引我吧！",
			投降: "这局你赢了，朋友！",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		瓦莉拉: {
			开局: "当心你的背后",
			镜像开局: "不用你提醒我，哼",
			攻击: "我们上",
			投降: "我输了",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		//皮肤
		麦迪文: {
			开局: "就让比赛开始吧",
			镜像开局: "哦，比赛已经开始了",
			攻击: "用武器攻击还真是滑稽",
			投降: "这是步好棋，我认输",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		奥蕾莉亚: {
			开局: "在精灵的力量面前颤抖吧！",
			镜像开局: "我从不颤抖！",
			攻击: "你的死期将至！",
			投降: "你技高一筹，我认输",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		莉亚德琳: {
			开局: "神圣之火燃烧着我的战刃！",
			镜像开局: "神圣之火正是我的名号",
			攻击: "在神圣之火中燃烧！",
			投降: "朋友，你赢了。我认输",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		泰兰德: {
			开局: "艾露恩赐予我力量",
			镜像开局: "月神庇护着我",
			攻击: "为了艾露恩！",
			投降: "结束吧，你赢了",
			//彩蛋
			玛法里奥: "我亲爱的玛法里奥",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		麦格尼: {
			开局: "为了卡兹莫丹！",
			镜像开局: "是的，为了卡兹莫丹！",
			攻击: "吃我一锤！",
			投降: "啊，你战胜了我",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		露娜拉: {
			开局: "森林也是会反抗的！",
			镜像开局: "为了大自然！",
			攻击: "这很管用",
			投降: "我输了",
			玛法里奥: "Ishnu'alah，大德鲁伊",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		奈姆希: {
			开局: "让我们来找点乐子吧！",
			镜像开局: "耶！真是棒极了！",
			攻击: "一起嗨起来！",
			投降: "厉害！这次是你赢了",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		雷电之王: {
			开局: "吾乃弑君之君，诛神之神",
			镜像开局: "如此，才配与我一战",
			攻击: "你犯了一个可悲的错误",
			投降: "这一次，算你赢",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		玛维: {
			开局: "没人能逃出我的手掌心！",
			镜像开局: "我就是正义之手！",
			攻击: "我代表正义消灭你！",
			投降: "打得好，我认输",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		卡德加: {
			开局: "知识就是力量。",
			镜像开局: "愿我们共同成长。",
			攻击: "为了艾泽拉斯。",
			投降: "很出色，你赢了。",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		瓦丝琪女士: {
			开局: "你的生命终结了！",
			镜像开局: "但我总能找到生路。",
			攻击: "吃我一箭！",
			投降: "这次……是你赢了。",
			//彩蛋
			伊利丹: "这是我的荣幸，伊利丹大人。",
			玛维: "啊，区区守望者。",
			摩戈尔: "大海在唤你回家，小家伙。",
			泰兰德: "一万年过去了，你还是那么令人讨厌。",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		//ZZADAN
		吕布加尔鲁什: {
			开局: "我，无人能挡！",
			镜像开局: "嗯？是吗？",
			攻击: "无双之力！",
			投降: "我选择死亡。",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		诸葛亮安度因: {
			开局: "运筹帷幄，亦可取胜！",
			镜像开局: "此战确应智取……",
			攻击: "还不退下！",
			投降: "你击败了我",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		关羽乌瑟尔: {
			开局: "决定胜负者，唯有大义。",
			镜像开局: "世间之路，唯有正义。",
			攻击: "义勇当先！",
			投降: "胜利属于你",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		白雪: {
			开局: "我绝不能退缩。",
			镜像开局: "我也不会给你这个选项。",
			攻击: "退后！",
			投降: "这场战斗……你赢了……",
			需要武器: "我需要武器。",
			法力值不够: "我需要更多法力值。",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "那个随从还没有准备好。",
			手牌十张: "我的手牌满了！",
			满场七随从: "没有位置了。",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		艾莎: {
			开局: "感受这寒风的威力！",
			镜像开局: "还有飞雪与冰霜！",
			攻击: "不要挑衅我。",
			投降: "结束吧，你赢了。",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		大乔伊莉斯: {
			开局: "啊，你来得正好！",
			镜像开局: "很好，就该这样",
			攻击: "想尝一口吗？",
			投降: "胜利属于你！",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		小乔阿兰娜: {
			开局: "该演奏哪一首呢？",
			镜像开局: "就这首熟悉的吧。",
			攻击: "跟上节拍！",
			投降: "我必须撤退。",
			需要武器: "我需要一把武器。",
			法力值不够: "我需要法力值！",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "那个随从需要一个回合准备。",
			手牌十张: "我的手牌满了！",
			满场七随从: "我的随从太多了。",
			攻击潜行随从: "那个随从潜行了。",
			不能使用: "我不能使用它。",
			非有效目标: "我需要一个目标。",
			场面有嘲讽: "我必须攻击那个嘲讽随从。",
			普通错误: "我不能那么做。",
			//彩蛋
			大乔伊莉斯: "我又学了些新手段，姐姐。",
		},
		曹操拉法姆: {
			开局: "团结一致，称霸达拉然！",
			镜像开局: "不错，不错！",
			攻击: "拉法姆！！",
			投降: "我身边全是蠢货！",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		貂蝉瓦莉拉: {
			开局: "谁愿与我起舞？",
			镜像开局: "独舞，不如对舞。",
			攻击: "哈！",
			投降: "暂且如此吧！",
			需要武器: "给我挑一把武器嘛，最好是扇子。",
			法力值不够: "法力值不足。",
			随从已攻击: "它不能再次攻击。",
			英雄已攻击: "我不能再次出击。",
			随从需准备: "它还需要准备。",
			手牌十张: "我的牌太多了！",
			满场七随从: "战场已满！",
			攻击潜行随从: "它藏起来了，好可惜。",
			不能使用: "我也无能为力。",
			非有效目标: "那在我范围之外。",
			场面有嘲讽: "有人在嘲讽我呢。",
			普通错误: "不行。",
			//彩蛋
			关羽乌瑟尔: "将军何必如此严肃？",
			吕布加尔鲁什: "我愿永远追随将军。",
			诸葛亮安度因: "且看先生有何见教。",
		},
		惠惠: {
			开局: "可以陪我练习爆裂魔法吗？",
			镜像开局: "就稍微陪你一会儿吧！",
			攻击: "哈啊！",
			投降: "咕...好不甘心。",
			需要武器: "我需要一把武器",
			法力值不够: "我没有足够的法力值",
			随从已攻击: "那个随从已经攻击过了",
			英雄已攻击: "我已经攻击过了",
			随从需准备: "给那个随从一个回合的准备时间",
			手牌十张: "我的手牌满了！",
			满场七随从: "我召唤了太多的随从！",
			攻击潜行随从: "我不能以潜行的随从作为目标",
			不能使用: "我不能使用这张牌",
			非有效目标: "这不是一个合理的目标",
			场面有嘲讽: "我必须攻击那个具有嘲讽的随从",
			普通错误: "我不能这么做",
		},
		//染柒
		染柒: {
			开局: "不要靠近我的头发！",
			镜像开局: "比比看，谁的小蜘蛛更厉害？",
			攻击: "快停下来，根本打不死人啦！",
			投降: "大佬666",
		},
		//特殊随从台词
		奈法利安: {
			德鲁伊: "德鲁伊，大自然已经听命于我了！",
			猎人: "现在，猎人成了猎物！",
			法师: "法师，小心你的魔法把你毁了！",
			圣骑士: "圣骑士！你是不是已经被圣光抛弃了？",
			牧师: "牧师！现在圣光服从于我！",
			潜行者: "潜行者，别躲躲藏藏了，面对我吧！",
			萨满祭司: "萨满！现在元素听从我的号令！",
			术士: "术士，你在玩弄你根本不了解的魔法！",
			战士: "战士，你的力量将成为你的弱点！",
			腐化者: "腐化者，见识下真正的用毒大师！",
			中立: "你的魔法归我了！",
		},
		加拉克苏斯大王: {
			开局: "面对Jaraxxus吧，燃烧军团的艾瑞达之王",
			镜像开局: "面对Jaraxxus吧，燃烧军团的艾瑞达之王",
			攻击: "哈哈哈哈哈",
			投降: "你赢了...但这个世界已经在劫难逃！！",
		},
		炎魔之王拉格纳罗斯: {

		},
		//首领
		帕奇维克: {
			开局: "帕奇维克要跟你玩！",
			死亡: "帕奇维克怎么了……啊……",
		},
		大宝: {
			开局: "不要犯大吴疆土哦",
			攻击: ["若敢来犯，必叫你大败而归", "犯大吴疆土者，盛必击而破之"],
			死亡: "盛只恨，不能再为主公，破敌致胜了……",
		},
	},
	ski: { //专属技能描述
		summon: ["召唤", "从手牌召唤一个随从"],
		battle: ["进攻", "一名角色对另一名角色发起进攻"],
		death: ["阵亡", "这些角色阵亡，并移出游戏"],
	},
	dftDeck: { //默认卡组
		//奴隶战-朝神
		hero_garrosh: ["怒火中烧*2", "旋风斩*2", "斩杀*2", "战斗怒火*2", "严酷的监工*2", "铸甲师*2", "蹒跚的食尸鬼*2", "炽炎战斧*2", "战歌指挥官*2", "暴乱狂战士*2", "盾牌格挡*1", "苦痛侍僧*2", "死亡之咬*2", "侏儒发明家*1", "恐怖的奴隶主*2", "索瑞森大帝*1", "格罗玛什·地狱咆哮*1"],
		//机械法-东少
		hero_jaina: ["火球术*2", "地精炎术师*2", "碎雪机器人*2", "法力浮龙*2", "不稳定的传送门*1", "寒冰箭*2", "发条侏儒*2", "机械跃迁者*2", "吵吵机器人*2", "蜘蛛坦克*2", "工匠镇技师*1", "载人收割机*2", "齿轮大师*2", "大法师安东尼达斯*1", "砰砰博士*1", "洛欧塞布*1", "虚灵巫师*1", "A3型机械金刚*2"],
		//t7猎-百度经验
		hero_rexxar: ["叫嚣的中士*1", "麻风侏儒*2", "飞刀杂耍者*2", "疯狂的科学家*2", "鬼灵爬行者*1", "铁喙猫头鹰*2", "奥术傀儡*2", "狼骑兵*2", "快速射击*2", "照明弹*1", "捕熊陷阱*1", "爆炸陷阱*2", "重型刃弩*2", "鹰角弓*2", "关门放狗*2", "动物伙伴*2", "杀戮命令*2"],
		//94牧-东少
		hero_anduin: ["神圣惩击*1", "心灵视界*2", "缩小射线工程师*1", "希尔瓦娜斯·风行者*1", "精神控制*2", "秘教暗影祭司*2", "圣光炸弹*2", "神圣之火*2", "淤泥喷射者*2", "老式治疗机器人*1", "洛欧塞布*1", "思维窃取*2", "暗言术：痛*2", "暗影狂乱*2", "神圣新星*1", "暗言术：灭*2", "北郡牧师*2", "精神控制技师*2"],
		//动物园-消失的卡组
		hero_guldan: ["末日守卫*2", "小鬼爆破*2", "力量的代价*2", "虚空行者*2", "烈焰小鬼*2", "小鬼首领*2", "黑市摊贩*2", "叫嚣的中士*2", "鬼灵爬行者*2", "铁喙猫头鹰*1", "蛛魔之卵*2", "恐狼前锋*2", "飞刀杂耍者*2", "强化机器人*1", "洛欧塞布*1", "阿古斯防御者*2", "布莱恩·铜须*1"],
		//魔能德-geyuan6
		hero_malfurion: ["激活*2", "活体根须*2", "达纳苏斯豹骑士*2", "刃牙德鲁伊*2", "狂野争斗者*1", "丛林守护者*2", "野蛮咆哮*2", "横扫*2", "利爪德鲁伊*2", "自然之力*2", "麻风侏儒*2", "飞刀杂耍者*2", "载人收割机*2", "纳克萨玛斯之影*2", "砰砰博士*1", "魔能机甲*2"],
		//死鱼骑-geyuan6
		hero_uther: ["奥达曼守护者*1", "奉献*2", "真银圣剑*2", "酸性沼泽软泥怪*1", "老式治疗机器人*2", "淤泥喷射者*1", "末日预言者*2", "狂野炎术师*2", "老瞎眼*1", "圣疗术*2", "亡者归来*2", "严正警戒*2", "奥尔多卫士*2", "生而平等*2", "苦痛侍僧*2", "蓝腮战士*2", "鱼人领军*2"],
		//机械萨-逗游
		hero_thrall: ["大地震击*1", "石化武器*2", "肉用僵尸*2", "鬼灵爬行者*2", "火舌图腾*2", "王牌猎人*1", "麦田傀儡*1", "闪电风暴*2", "动力战锤*2", "妖术*2", "法力之潮图腾*1", "风领主奥拉基尔*1", "雷霆崖勇士*1", "施法者克星X-21*1", "载人收割机*2", "老式治疗机器人*2", "碧蓝幼龙*1", "淤泥喷射者*1", "砰砰博士*1", "载人飞天魔像*1", "阿古斯防御者*1"],
		//刀油贼-geyuan6
		hero_valeera: ["背刺*2", "伺机待发*2", "致命药膏*2", "军情七处特工*2", "刺骨*2", "剑刃乱舞*2", "闷棍*2", "艾德温·范克里夫*1", "刀扇*2", "修补匠的磨刀油*2", "盗墓匪贼*1", "疾跑*2", "淤泥喷射者*1", "洛欧塞布*1", "碧蓝幼龙*2", "紫罗兰教师*2", "大地之环先知*1", "血法师萨尔诺斯*1"],
		//皮肤
		//天选法-东少
		hero_medivh: ["大法师安东尼达斯*1", "索瑞森大帝*1", "雷诺·杰克逊*1", "阿莱克丝塔萨*1", "血法师萨尔诺斯*1", "暴风雪*1", "炎爆术*1", "寒冰护体*2", "冰霜新星*2", "寒冰屏障*2", "冰枪术*2", "寒冰箭*2", "奥术智慧*2", "末日预言者*2", "老旧的火把*1", "火球术*1", "冰锥术*1", "疯狂的科学家*2", "苦痛侍僧*1", "战利品贮藏者*1", "工程师学徒*1", "烈焰风暴*1"],
		//变速猎-geyuan6
		hero_alleria: ["长鬃草原狮*2", "洛欧塞布*1", "砰砰博士*1", "快速射击*1", "鹰角弓*1", "科赞秘术师*1", "铁喙猫头鹰*1", "猎人印记*1", "关门放狗*2", "动物伙伴*2", "杀戮命令*2", "爆炸陷阱*1", "重型刃弩*1", "冰冻陷阱*2", "麻风侏儒*2", "叫嚣的中士*1", "鬼灵爬行者*2", "飞刀杂耍者*2", "疯狂的科学家*2", "狼骑兵*1", "奥术傀儡*1"],
		//摸腿骑-geyuan6
		hero_liadrin: ["力量祝福*1", "护盾机器人*2", "生而平等*1", "齿轮光锤*1", "神恩术*2", "作战动员*2", "奉献*2", "愤怒之锤*1", "真银圣剑*2", "王者祝福*2", "南海船工*2", "叫嚣的中士*2", "银色侍从*2", "麻风侏儒*2", "火车王里诺艾*1", "飞刀杂耍者*2", "铁喙猫头鹰*2", "穆克拉*1"],
		//挖宝龙牧-geyuan6
		hero_tyrande: ["北郡牧师*2", "真言术：盾*2", "龙眠教官*2", "黑暗教徒*1", "维伦的恩泽*2", "秘教暗影祭司*2", "暮光雏龙*2", "黑翼腐蚀者*2", "碧蓝幼龙*2", "黑翼技师*1", "冰喉*1", "伊瑟拉*1", "布莱恩·铜须*1", "伊莉斯·逐星*1", "银色神官帕尔崔丝*1", "埋葬*2", "圣光炸弹*1", "暮光幼龙*1", "暮光守护者*2", "神圣新星*1"],
		//防战-geyuan6
		hero_magni: ["盾牌猛击*2", "斩杀*2", "炽炎战斧*2", "猛击*1", "复仇打击*2", "怒袭*2", "盾牌格挡*2", "死亡之咬*2", "绝命乱斗*2", "格罗玛什·地狱咆哮*1", "盾甲侍女*2", "裁决者图哈特*1", "死亡领主*2", "苦痛侍僧*2", "王牌猎人*1", "伊莉斯·逐星*1", "淤泥喷射者*2", "哈里森·琼斯*1"],
		//hero_elise: ["精灵弓箭手*2", "石牙野猪*2", "蓝腮战士*2", "恐狼前锋*2", "鬼灵爬行者*2", "淡水鳄*2", "鱼人猎潮者*2", "银背族长*2", "冰风雪人*2", "狼骑兵*2", "暴怒的狼人*2", "载人收割机*2", "碧蓝幼龙*2", "火车王里诺艾*1", "银色指挥官*2", "砰砰博士*1"],
		//咆哮德-geyuan6
		hero_lunara: ["洛欧塞布*1", "索瑞森大帝*1", "砰砰博士*1", "王牌猎人*1", "载人收割机*2", "碧蓝幼龙*2", "纳克萨玛斯之影*1", "激活*2", "活体根须*1", "达纳苏斯豹骑士*2", "愤怒*2", "野性成长*2", "野蛮咆哮*2", "丛林守护者*2", "横扫*2", "利爪德鲁伊*2", "知识古树*2", "自然之力*2"],
		//宇宙术-geyuan6
		hero_nemsy: ["力量的代价*1", "黑市摊贩*1", "小鬼首领*1", "恶魔之怒*1", "死亡缠绕*1", "暗色炸弹*1", "地狱烈焰*1", "小鬼爆破*1", "暗影烈焰*1", "扭曲虚空*1", "叫嚣的中士*1", "肉用僵尸*1", "酸性沼泽软泥怪*1", "大地之环先知*1", "淤泥喷射者*1", "老式治疗机器人*1", "洛欧塞布*1", "无面操纵者*1", "火车王里诺艾*1", "索瑞森大帝*1", "雷诺·杰克逊*1", "砰砰博士*1", "加拉克苏斯大王*1", "灵魂虹吸*1", "阿古斯防御者*1", "暮光幼龙*1", "载人收割机*1", "铁喙猫头鹰*1", "精神控制技师*1", "王牌猎人*1"],
		//打脸萨-geyuan6
		hero_thunder: ["叫嚣的中士*2", "麻风侏儒*2", "芬利·莫格顿爵士*1", "鬼灵爬行者*2", "飞刀杂耍者*2", "银色骑手*2", "坑道穴居人*2", "闪电箭*2", "火舌图腾*2", "图腾魔像*2", "连环爆裂*2", "熔岩震击*1", "熔岩爆裂*2", "野性狼魂*2", "毁灭之锤*2", "石化武器*2"],
		//t6贼-东少
		hero_maiev: ["暗影步*2", "冷血*2", "麻风侏儒*2", "战利品贮藏者*2", "血法师萨尔诺斯*1", "奥术傀儡*2", "荆棘谷猛虎*1", "火车王里诺艾*1", "银色侍从*2", "迪菲亚头目*1", "毒刃*2", "军情七处特工*2", "刺骨*2", "剑刃乱舞*1", "致命药膏*2", "刺客之刃*1", "南海船工*1", "闷棍*2", "血骑士*1"],
		//无限火球法-17173
		hero_khadgar: ["大法师安东尼达斯*1", "索瑞森大帝*1", "暴风雪*2", "寒冰护体*2", "冰霜新星*2", "寒冰屏障*2", "寒冰箭*1", "奥术智慧*2", "末日预言者*2", "冰锥术*1", "疯狂的科学家*2", "工程师学徒*2", "烈焰风暴*1", "巫师学徒*2", "复制*1", "变形术*1", "麦迪文的残影*2", "寒光智者*2", "老式治疗机器人*1"],
		//鱼人萨-18183
		hero_vashj: ["沙鳞灵魂行者*2", "鱼人恩典*1", "毁灭之锤*1", "坑道穴居人*2", "石化武器*2", "图腾魔像*2", "先祖知识*1", "鱼人宝宝*2", "暗鳞先知*1", "鱼人招潮者*2", "芬利·莫格顿爵士*1", "淤泥践踏者*2", "蓝腮战士*2", "鱼人猎潮者*2", "寒光智者*2", "鱼人领军*2", "老瞎眼*1", "寒光先知*2"],
		//----ZZADAN----
		//火妖法-百度经验
		hero_zzhh: ["水元素*2", "火球术*2", "碧蓝幼龙*2", "虚灵勇士萨兰德*1", "砰砰博士*1", "大法师安东尼达斯*1", "烈焰风暴*1", "巫师学徒*2", "奥术飞弹*2", "烈焰轰击*1", "寒冰箭*2", "火妖*2", "镜像*2", "不稳定的传送门*1", "奥术智慧*2", "镜像实体*2", "疯狂的科学家*2", "法力浮龙*2"],
		//蔡依林术-大鲸淡
		hero_zzbx: ["力量的代价*2", "虚空行者*1", "叫嚣的中士*2", "黑市摊贩*2", "恐狼前锋*1", "铁喙猫头鹰*1", "鬼灵爬行者*2", "飞刀杂耍者*2", "蛛魔之卵*2", "王牌猎人*1", "小鬼首领*2", "砰砰博士*1", "海巨人*1", "玛尔加尼斯*1", "末日守卫*2", "洛欧塞布*1", "空灵召唤者*2", "小鬼爆破*2", "阿古斯防御者*2"],
		//战吼萨-JB51
		hero_zzas: ["风领主奥拉基尔*1", "火元素*2", "耐普图隆*1", "砰砰博士*1", "大地震击*1", "坑道穴居人*2", "石化武器*1", "先祖知识*1", "熔岩震击*1", "图腾魔像*2", "宝石甲虫*1", "元素毁灭*1", "妖术*2", "治疗波*1", "野性狼魂*1", "闪电风暴*2", "雷霆崖勇士*1", "老式治疗机器人*1", "碧蓝幼龙*2", "海象人图腾师*1", "布莱恩·铜须*1", "王牌猎人*1", "载人收割机*1", "阿古斯防御者*1"],
		//爆牌贼-东少
		hero_zzdcwll: ["芬利·莫格顿爵士*1", "末日预言者*2", "血法师萨尔诺斯*1", "酸性沼泽软泥怪*1", "布莱恩·铜须*1", "老式治疗机器人*2", "寒光智者*2", "死亡领主*2", "消失*2", "王牌猎人*1", "背刺*1", "伺机待发*2", "暗影步*2", "刺骨*2", "夜幕奇袭*2", "闷棍*2", "军情七处特工*1", "刀扇*2", "黑铁潜藏者*1"],
		//海盗战-geyuan6
		hero_zzlbjels: ["升级*1", "叫嚣的中士*2", "麻风侏儒*2", "南海船工*1", "芬利·莫格顿爵士*1", "铁喙猫头鹰*2", "战利品贮藏者*2", "英勇打击*1", "炽炎战斧*2", "怒袭*2", "死亡之咬*2", "奥金斧*2", "库卡隆精英卫士*2", "致死打击*2", "奥术傀儡*2", "银色骑手*2", "恐怖海盗*2"],
		//佛祖骑-geyuan6
		hero_zzgywse: ["复仇*2", "争强好胜*1", "崇高牺牲*2", "救赎*2", "忏悔*1", "护盾机器人*2", "生而平等*1", "作战动员*2", "军需官*1", "神秘挑战者*2", "奉献*2", "奥秘守护者*2", "神恩术*1", "齿轮光锤*1", "王者祝福*1", "飞刀杂耍者*2", "鬼灵爬行者*2", "载人收割机*2", "砰砰博士*1"],
		//灯神牧-geyuan6(有改动)
		hero_zzzglady: ["治疗之环*2", "心灵之火*2", "北郡牧师*2", "真言术：盾*2", "纳鲁之光*2", "迷乱*1", "快速治疗*2", "奥金尼灵魂祭司*2", "神圣之灵*2", "索瑞森大帝*1", "秘教暗影祭司*1", "狂野炎术师*2", "西风灯神*2", "苦痛侍僧*2", "日怒保卫者*1", "暗言术：灭*2", "死亡领主*2"],
		//墙德-东少
		hero_zzdqyls: ["洛欧塞布*1", "砰砰博士*1", "索瑞森大帝*1", "希尔瓦娜斯·风行者*1", "激活*2", "达纳苏斯豹骑士*1", "野性成长*2", "愤怒*2", "野蛮咆哮*1", "活体根须*1", "王牌猎人*1", "麦田傀儡*1", "载人收割机*2", "淤泥喷射者*2", "自然之力*1", "丛林守护者*2", "横扫*2", "利爪德鲁伊*2", "知识古树*2", "战争古树*2"],
		//奇迹猎-游戏大全
		hero_zzxqaln: ["猎人印记*2", "奥术射击*1", "追踪术*2", "冰冻陷阱*2", "子弹上膛*2", "载人收割机*2", "关门放狗*2", "鹰角弓*2", "快速射击*2", "杀戮命令*2", "动物伙伴*2", "鬼灵爬行者*2", "飞刀杂耍者*2", "铁喙猫头鹰*1", "疯狂的科学家*2", "毒蛇陷阱*2"],
		//蓝龙术-新浪游戏	
		hero_zzcclfm: ["灵魂之火*1", "小鬼首领*1", "叫嚣的中士*1", "大地之环先知*1", "铁喙猫头鹰*1", "死亡缠绕*2", "黑市摊贩*2", "暗色炸弹*2", "地狱烈焰*2", "暮光幼龙*2", "暮光守护者*2", "肉用僵尸*2", "碧蓝幼龙*2", "老式治疗机器人*2", "索瑞森大帝*1", "玛里苟斯*1", "黑翼腐蚀者*2", "王牌猎人*2", "布莱恩·铜须*1"],
		//染柒
		//宇宙挖宝动物园腐化者-自组
		hero_addiction: ["萃毒*1", "哥布林术士*1", "守护之心*1", "寻宝*1", "密林法师*1", "毒液溅射*1", "密林沼龙*1", "哥布林战士*1", "美杜莎之女*1", "能量释放*1", "密林射手*1", "恶魔之眼*1", "禁术法师*1", "蛇发女妖*1", "死域召唤*1", "魔蛛之域*1", "茶话会*1", "殊途同归*1", "弑君者*1", "哥布林悍匪*1", "蜘蛛人女王*1", "黯色游侠·罗宾汉*1", "雷诺·杰克逊*1", "老式治疗机器人*1", "宝石甲虫*1", "叫嚣的中士*1", "伊莉斯·逐星*1", "恐狼前锋*1", "飞刀杂耍者*1", "低阶侍从*1"],
	},
};